namespace P01_StudentSystemSeeder.DataValues
{
    public class Text
    {
        public static string[] FirstNames { get; } = new string[]
        {
            "Георги",
            "Иван",
            "Димитър",
            "Николай",
            "Петър",
            "Христо",
            "Александър",
            "Стефан",
            "Йордан",
            "Васил",
            "Тодор",
            "Стоян",
            "Атанас",
            "Ангел",
            "Красимир",
            "Пламен",
            "Никола",
            "Ивайло",
            "Валентин",
            "Мария",
            "Иванка",
            "Елена",
            "Йорданка",
            "Пенка",
            "Даниела",
            "Росица",
            "Десислава",
            "Гергана",
            "Марийка",
            "Виолета",
            "Маргарита",
            "Надежда",
            "Виктория",
            "Силвия",
            "Радка",
            "Емилия",
            "Румяна",
            "Милена"
        };

        public static string[] LaststNames { get; } = new string[]
        {
            "Георгиев",
            "Иванов",
            "Димитров",
            "Николаев",
            "Петров",
            "Христов",
            "Александров",
            "Стефанов",
            "Йорданов",
            "Василев",
            "Тодоров",
            "Стоянов",
            "Атанасов",
            "Ангелов",
            "Красимиров",
            "Пламенов",
            "Николов",
            "Ивайлов",
            "Валентинов"
        };

        public static string[] Courses { get; } = new string[]
        {
            "C#",
            "Java",
            "PHP",
            "JavaScript",
            "C++ ",
            "Pyton",
            "System Administration",
            "Blockchain",
            "Angular",
            "Arduino",
            "QA"
        };
    }
}
